In [1]:
import numpy as np
import pandas as pd

In [5]:
# You can convert a list, numpy array, or dictionary to a Series
labels = ['a', 'b', 'c']

# list
my_list = [10, 20, 30]

series = pd.Series(data=my_list)
print(series)

print('\nWith Labels/Index')

label_series = pd.Series(data=my_list, index=labels)
print(label_series)

0    10
1    20
2    30
dtype: int64

With Labels/Index
a    10
b    20
c    30
dtype: int64

In [8]:
dir(pd.Series)[-15:]

['transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [13]:
# array
arr = np.array([10, 20, 30])
print("Numpy array", + arr)

# convert to pandas series
pd.Series(arr, labels)

Numpy array [10 20 30]

a    10
b    20
c    30
dtype: int32

In [19]:
# dictonary data to series conversion
dict_data = {'a': 10, 'b': 20, 'c': 33, 'd': 40}
# dict_data

pd.Series(dict_data)

a    10
b    20
c    33
d    40
dtype: int64

## DataFrames

In [22]:
index = ['a', 'b', 'c', 'd', 'e']
columns = ['c1', 'c2', 'c3', 'c4', 'c5']

# random generate 5*5 matrix
data_array = np.random.randint(1, 100, (5, 5))
# data_array

dataFrames = pd.DataFrame(data=data_array, index=index, columns=columns)
dataFrames

   c1  c2  c3  c4  c5
a  92  52  96  15  21
b  82  27  28  98   9
c  54  28  55  48  77
d  77  85  10  43  73
e  51  33  66  44  20

In [23]:
dataFrames.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [25]:
type(dataFrames), type(dataFrames['c1'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [27]:
dataFrames.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int32
 1   c2      5 non-null      int32
 2   c3      5 non-null      int32
 3   c4      5 non-null      int32
 4   c5      5 non-null      int32
dtypes: int32(5)
memory usage: 140.0+ bytes

In [34]:
dataFrames.describe().T

    count  mean        std   min   25%   50%   75%   max
c1    5.0  71.2  17.935997  51.0  54.0  77.0  82.0  92.0
c2    5.0  45.0  24.525497  27.0  28.0  33.0  52.0  85.0
c3    5.0  51.0  33.451457  10.0  28.0  55.0  66.0  96.0
c4    5.0  49.6  30.071581  15.0  43.0  44.0  48.0  98.0
c5    5.0  40.0  32.326460   9.0  20.0  21.0  73.0  77.0

In [35]:
dataFrames

   c1  c2  c3  c4  c5
a  92  52  96  15  21
b  82  27  28  98   9
c  54  28  55  48  77
d  77  85  10  43  73
e  51  33  66  44  20

In [39]:
col_list = ['c1', 'c2']

new_df = dataFrames[col_list]
new_df

   c1  c2
a  92  52
b  82  27
c  54  28
d  77  85
e  51  33

In [43]:
new_df[dataFrames.c1 > 70]

   c1  c2
a  92  52
b  82  27
d  77  85

In [47]:
dataFrames

   c1  c2  c3  c4  c5
a  92  52  96  15  21
b  82  27  28  98   9
c  54  28  55  48  77
d  77  85  10  43  73
e  51  33  66  44  20

In [52]:
# drop/remove row
# axis 1 col, axis 0 row
dataFrames.drop('a', axis = 0)

   c1  c2  c3  c4  c5
b  82  27  28  98   9
c  54  28  55  48  77
d  77  85  10  43  73
e  51  33  66  44  20

In [53]:
# drop/remove column
dataFrames.drop('c5', axis=1)

   c1  c2  c3  c4
a  92  52  96  15
b  82  27  28  98
c  54  28  55  48
d  77  85  10  43
e  51  33  66  44

In [64]:
df_missing = pd.DataFrame({'A': [1, 2, np.nan],
                           'B': [2, np.nan, None],
                           'C': [1, 2, None]})
df_missing

     A    B    C
0  1.0  2.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

In [71]:
df_missing.isna().sum()

A    1
B    2
C    1
dtype: int64

In [72]:
df_missing.dropna()

     A    B    C
0  1.0  2.0  1.0

In [73]:
df_missing.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [80]:
df_missing.dropna(thresh=2)

     A    B    C
0  1.0  2.0  1.0
1  2.0  NaN  2.0

In [82]:
print(df_missing)

new_df = df_missing.fillna(value='Missing')
new_df

     A    B    C
0  1.0  2.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

         A        B        C
0      1.0      2.0      1.0
1      2.0  Missing      2.0
2  Missing  Missing  Missing